Merge pull request #1 from cyokozai/feat/setup
Enhance deployment setup with Docker, Ansible, and documentation
